{
    "index-page-title": "Home",
    "playground-page-title": "Playground",
    "templates-page-title": "Templates",
    "title": "Bootstrap 4",
    "menu-1": "Home",
    "menu-2": "Bootstrap 4",
    "menu-3": "Why bootstrap?",
    "menu-4": "How to",
    "menu-5": "Playground",
    "menu-6": "Templates",
    "menu-7": "About us",
    "search-placeholder": "Search",
    "lang": "Languages",
    "lang-1": "Serbian",
    "lang-2": "English",
    "title-1": "Code fast!",
    "title-2": "PROJECT ASSIGNMENT",
    "title-3": "WEB TECHNOLOGIES – FTN ČAČAK",
    "welcome-title": "WELCOME",
    "welcome-text-1": "This site was created as a project assignment for the Web technologies course on the Faculty of technical sciences in Čačak.",
    "welcome-text-2": "Bootstrap allows you to quickly construct and design the backbone of your new page for pets, blog about your favourite videogames, or a project for a very interesting course in a college – you name it. In short, wherever help is needed for making webpages that will look pretty and function as good, no mind if it were on a PC, tablet, or a smartphone, Bootstrap will make your job easier.",
    "welcome-text-3": "Bootstrap is free and open-source framework for rapid development of responsive webpages, which greatly simplifies the process of building with its frequently-used functionality and design presets, that are otherwise hard to code without Bootstrap. Because of that, Bootstrap is widely used, not only by beginners, but also by big companies, that want the long-lasting reliability of Bootstrap, which is confirmed by years of use in industry and a plethora of pages that have it included.",
    "welcome-text-4": "Core of Bootstrap, if we were to delve into its internals, is comprised of the same fabric that is used to build the rest of the Internet, and that’s what enables it to be so simple, yet so powerful, fluid, and compatible.",
    "html-title": "HTML5",
    "html-text": "The backbone of the Internet!",
    "css-title": "CSS3",
    "css-text": "Give look and feel to your page!",
    "js-title": "JS",
    "js-text": "Breathe life to your page!",
    "other-tech-title": "TECHNOLOGIES",
    "other-tech-text": "Apart from the aforementioned technologies, during the implementation of the project, we also used:",
    "vs-title": "Visual Studio Code",
    "vs-text": "Source code editor that supports a wide range of programming languages, but is mostly focused on web development. It has a variety of extensions and libraries for use, that ease the development process.",
    "vs-button-text": "Visit Visual Studio Code!",
    "git-title": "GitHub",
    "git-text": "Leading platform for source control that uses Git system, and is crucial for successful project control, management, and coordination.",
    "git-button-text": "Visit GitHub!",
    "meet-team": "MEET THE TEAM",
    "member-1": " Stefan Jovanović",
    "member-2": " Predrag Radovanović",
    "member-3": " Slavko Džulović",
    "pr-birth-date": "Date of birth: 21.07.1997",
    "pr-index-num": "Student ID:: 14-2016",
    "pr-birth-place": "Place of birth: Požega",
    "pr-faculty": "College: Faculty of technical sciences in Čačak",
    "pr-dir": "Department: Information technologies",
    "pr-gpa": "GPA: 8.00",
    "sdz-birth-date": "Date of births: 13.03.1997",
    "sdz-birth-place": "Place of birth: Priboj",
    "sdz-index-num": "Student ID:: 87-2016",
    "sdz-high-school": "Secondary school: Gymnasium Priboj",
    "sdz-faculty": "College: Faculty of technical sciences in Čačak",
    "sdz-dir": "Department: Information technologies",
    "sdz-gpa": "GPA: 9.14",
    "sj-birth-date": "Date of birth: 10.01.1998",
    "sj-birth-place": "Place of birth: Jagodina",
    "sj-index-num": "Student ID:: 34-2016",
    "sj-high-school": "Secondary school: Technology school Paraćin",
    "sj-faculty": "College: Faculty of technical sciences in Čačak",
    "sj-dir": "Department: Information technologies",
    "sj-gpa": "GPA: 9.20",
    "pr-high-school": "Secondary school: Gymnasium Požega",
    "_comment": "BOOTSTRAP 4 PAGE",
    "bs4-title-1": "How Bootstrap came about?",
    "bs4-text-1": "Bootstrap wasn’t, from it’s beginning, the framework that is now used all over the internet.",
    "bs4-text-2": "First known as Twitter Blueprint, Bootstrap was initially conceived as a internal side project of Twitter’s programmers, who wanted it to improve Twitter itself, by replacing the previously used libraries, that weren’t up to standards. They were corrupting the internal structure and induced a load of maintenance burden upon the developers. Even though a new framework wasn’t planned per se, spontaneusly, as this side project progressed, a new product emerged, soon to become available to general programming audience, on April the 19th, 2011.",
    "bs4-versions-title": "Versions",
    "bs4-versions-text-1": "After the initial release, when it became clear that Bootstrap overcame the excpectations and the scope of Twitter, the development team soon shifted to active work and maintenance, as a separate project on its own.",
    "bs4-versions-text-2": "With version 2.0, Bootstrap added a typography support, in form of Glyphicons, and several other components. However, the basis for the future development of Bootstrap, as well as what Bootstrap pioneered and is known for, came about in this release. The responsive design was added as an optional functionality, that wasn’t forced as mandatory, but nevertheless became the defining characteristic of Bootstrap for that and future versions.",
    "bs4-versions-text-3": "In version 3, in April 2013, the project made a shift to a minimalistic design, the responsiveness was made the default option, and as such, new, mobile-first approach was taken in designing the usage of Bootstrap.",
    "bs4-versions-text-4": "With version 4, january 2018, a large change ensued in the internal structure and code inside of Bootstrap. Preprocessor language for compiling CSS was changed from Less to Sass, em was made default measuring unit instead of pixels, Glyphicon support was dropped, and the greatest change was a shift to CSS Flexbox layout, which further increased the flexibility and ease of use.",
    "bs4-usage-title": "Where is Bootstrap used?",
    "bs4-usage-text-1": "Mainly for its ease of use, but high successes, Bootstrap surged through to the top in relatively short time among the rest of the frontend frameworks. Besides, Bootstrap’s GitHub repo is second-most starred repo, just after freeCodeCamp repo.",
    "bs4-usage-text-2": "Also, according to data for 2018, Bootstrap was featured on about 18% among one million of top-rated sites, or about 17% among the first ten thousand sites.",
    "bs4-title": "BOOTSTRAP 4",
    "footer-title": "About project",
    "footer-text": "This site is created as a project assigment for Web technologies course on Faculty of technical sciences in Čačak, as a mean of completing the final exam. Students that have taken part in this project are Stefan Jovanović, Predrag Radovanović, and Slavko Džulović.",
    "copyright-text": "© 2019 Copyright: METRoTEAM",
    "download-text": "Download",
    "playground-html-text": "Write code here or copy template from above",
    "playground-js-text": "Try to write JS"
}