{
    "index-page-title": "Početna",
    "playground-page-title": "Igralište",
    "templates-page-title": "Galerija",
    "title": "Butstrep 4",
    "menu-1": "Početna",
    "menu-2": "Butstrep 4",
    "menu-3": "Prednosti",
    "menu-4": "Prednosti",
    "menu-5": "Igralište",
    "menu-6": "Galerija",
    "menu-7": "O autorima",
    "search-placeholder": "Pretraga",
    "lang": "Jezik",
    "lang-1": "Srpski (ćirilica)",
    "lang-2": "Engleski",
    "lang-3": "Srpski (latinica)",
    "title-1": "Kodirajte brže!",
    "title-2": "PROJEKTNI ZADATAK",
    "title-3": "VEB TEHNOLOGIJE - FTN ČAČAK",
    "welcome-title": "DOBRODOŠLI",
    "welcome-text-1": "Ovaj sajt je nastao kao projektni rad za predmet Veb tehnologije na Fakultetu tehničkih nauka u Čačku.",
    "welcome-text-2": "Butstrep (Bootstrap) Vam omogućava da brzo konstruišete i stilizujete okosnicu Vaše nove stranice o kućnim ljubimcima, bloga o omiljenim video igrama, projekta za jedan jako zanimljiv predmet na fakultetu – ukratko, gde god je potrebna pomoć sa pravljenjem stranica koje će izgledati lepo i funkcionisati podjednako dobro bilo na telefonu, tabletu ili desktop računaru, Butstrep će olakšati posao.",
    "welcome-text-3": "Butstrep je besplatan softverski okvir (framework) otvorenog koda za brzu izradu veb stranica koje su responzivne i koji znatno olakšava rad svojim ugrađenim opcijama za funkcionalnosti i dizajn koje se često koriste, a koje su teško postižne običnim kodiranjem bez pomoći Butstrepa. Stoga, Butstrep je jako korišćen, što od strane početnika, kao i kod velikih firmi, koje žele dugotrajnu pouzdanost koju donosi Butstrep, koja je potvrđena što dugim nizom godina, tako i velikim brojem stranica koje ga koriste.",
    "welcome-text-4": "Srž Butstrepa, s programske strane, je ista kao i kod ostatka Interneta, i upravo to mu omogućava jednostavnost ali, s druge strane, fluidnost i kompatibilnost:",
    "html-title": "HTML5",
    "html-text": "Osnova interneta!",
    "css-title": "CSS3",
    "css-text": "Ulepšajte osnovu!",
    "js-title": "JS",
    "js-text": "Udahnite osnovi život!",
    "other-tech-title": "TEHNOLOGIJE",
    "other-tech-text": "Sem navedenih tehnologija, u realizaciji ovog projekta korišćeni su i:",
    "vs-title": "Visual Studio Code",
    "vs-text": "Multiprogramski editor za uređivanje izvornog koda, sa fokusom na razvoj veb stranica, sa velikim broj dostupnih biblioteka i ekstenzija za olakšan rad i dodate mogućnosti.",
    "vs-button-text": "Posetite Visual Studio Code!",
    "git-title": "GitHub",
    "git-text": "Vodeća platforma za upravljanje verzijama izvornog koda uz pomoć Git sistema, krucijalna za uspešan rad i završavanje projekta.",
    "git-button-text": "Posetite GitHub!",
    "meet-team": "UPOZNAJTE TIM",
    "member-1": " Stefan Jovanović",
    "member-2": " Predrag Radovanović",
    "member-3": " Slavko Džulović",
    "member-1-text-1": "Rođen 10.01.1998. u Jagodini. Srednju tehnološku školu u Paraćinu završava 2016. godine, nakon čega započinje studiranje na Fakultetu tehničkih nauka u Čačku, smer Informacione tehnologije. Vrstan poznavalac programerske struke, sa širokim spektrom korišćenja programskih jezika, Stefan se pokazao ka izvrstan problem-solver tokom minulog rada.",
    "member-1-text-2": "Na ovom projektu, Stefan je bio zadužen za iznalaženje rešenja za funkcionalnosti sajta, izradom JavaScript logike, kao i za tehničke pojedinosti timskog rada.",
    "member-2-text-1": "Rođen 21.07.1997. u Požegi. Gimnaziju „Sveti Sava“ završava 2016. godine, nakon čega započinje studiranje na Fakultetu tehničkih nauka u Čačku, smer Informacione tehnologije. Pasionirani šahista, gitarista i frontend programer, Predrag u svom poslu nastoji da spoji kreativno i upotrebljivo.",
    "member-2-text-2": "Na ovom projektu, Predrag je učestvovao u dizajnu i kreiranju stranica, osmišljavanju animacija i implementiranju dizajnerskih zahteva.",
    "member-3-text-1": "Rođen 13.03.1997. u Priboju. Gimnaziju Priboj završava 2016. godine, nakon čega započinje studiranje na Fakultetu tehničkih nauka u Čačku, smer Informacione tehnologije. Programer po struci, istoričar u duši, Slavko je na projektu bio zadužen za osmišljavanje strukture stranica, upravljanjem i ažuriranjem dokumentacije, kao i za pronalaženje, objedinjavanje i prevođenje relevantnog sadržaja.",
    "pr-birth-date": "Datum rođenja: 21.07.1997",
    "pr-birth-place": "Mesto rođenja: Požega",
    "pr-index-num": "Broj indeksa: 14-2016",
    "pr-high-school": "Srednja škola: Gimnazija Požega",
    "pr-faculty": "Fakultet: Fakultet Tehničkih Nauka u Čačku",
    "pr-dir": "Smer: Informacione tehnologije",
    "pr-gpa": "Prosek: 8.00",
    "sdz-birth-date": "Datum rođenja: 13.03.1997",
    "sdz-birth-place": "Mesto rođenja: Priboj",
    "sdz-index-num": "Broj indeksa: 87-2016",
    "sdz-high-school": "Srednja škola: Gimnazija Priboj",
    "sdz-faculty": "Fakultet: Fakultet Tehničkih Nauka u Čačku",
    "sdz-dir": "Smer: Informacione tehnologije",
    "sdz-gpa": "Prosek: 9.14",
    "sj-birth-date": "Datum rođenja: 10.01.1998",
    "sj-birth-place": "Mesto rođenja: Jagodina",
    "sj-index-num": "Broj indeksa: 34-2016",
    "sj-high-school": "Srednja škola: Tehnološka škola Paraćin",
    "sj-faculty": "Fakultet: Fakultet Tehničkih Nauka u Čačku",
    "sj-dir": "Smer: Informacione tehnologije",
    "sj-gpa": "Prosek: 9.20",
    "footer-title": "O projektu",
    "footer-text": "Ovaj sajt je kreiran po zahtevima projektnog zadatka za predmet Veb tehnologije na Fakultetu tehničkih nauka u Čačku, u cilju polaganja ispita i formiranja završne ocene. U radu na ovom sajtu su učestvovali studenti Stefan Jovanović, Predrag Radovanović i Slavko Džulović. Tema ovog projektnog rada je frontend framework Bootstrap 4.",
    "copyright-text": "© 2019 Sva prava zadržana: METRoTEAM",
    "_comment": "BOOTSTRAP 4 PAGE",
    "bs4-title": "BUTSTREP 4",
    "bs4-title-1": "Odakle Butstrep?",
    "bs4-text-1": "Butstrep nije od svog početka bio ovaj frejmvork koji je korišćen u svim razmerama širom interneta.",
    "bs4-text-2": "Prvobitno znan kao Twitter Blueprint, Butstrep je nastao kao čedo Tviterovih programera za interne potrebe poboljšavanja samog Tvitera, da bi zamenio sve prethodne biblioteke koje su bile u upotrebi ali nisu zadovoljavale standarde, jer su narušavale internu stabilnost i nanosile su velike troškove održavanja. Iako nije bilo u planu da se napravi novi frejmvork, spontano, dodavanjem i usavršavanjem koda, stvoren je novi proizvod, koji je postao dostupan široj programerskoj sceni 19. aprila 2011.",
    "bs4-versions-title": "Verzije",
    "bs4-versions-text-1": "Nakon početne verzije, kada je već postalo jasno da je Butstrep prevazišao okvire Tvitera, prešlo se na aktivan razvoj i održavanje kao izdvojen projekat.",
    "bs4-versions-text-2": "Sa verzijom 2, Butstrepu je priključena podrška za ikonice (Glyphicons), kao i par novih komponenti. Takođe, osnova budućeg razvoja Butstrepa, kao i ono po čemu je Butstrep bio pionir u svojoj oblasti, dodato je u drugoj stabilnoj verziji. Responzivni dizajn je dodat kao opciona funkcionalnost, koja nije bila nametana kao mandatorna, ali je svakako postala određujuća karakteristika Butstrepa za tu, kao i sve naredne verzije.",
    "bs4-versions-text-3": "U verziji tri, arpila 2013, prešlo se na minimalistički dizajn, a responzivnost je postala podrazumevana opcija, i počelo se sa forsiranjem verzija za mobilne uređaje, takozvani mobile-first pristup u dizajnu.",
    "bs4-versions-text-4": "Sa verzijom 4, januara 2018, došlo je do velike izmene u internoj strukturi i kodu unutar Butstrepa. Promenjen je preprocesorski jezik za kompajliranje CSS-a (sa Less prešlo se na Sass), pikseli su zamenjeni kao standardna merna jedinica tzv. em jedinicom, izbačena je podrška za Glyphicon klasu, a kao najbitnija promena navodi se korišćenje CSS Flexbox modela rasporeda, što je dodatno poboljšalo fleksibilnost u radu.",
    "bs4-usage-title": "Gde se koristi Butstrep?",
    "bs4-usage-text-1": "Upravo zbog svoje jednostavnosti, a velikih postignutih rezultata, Butstrep se za relativno kratko vreme probio na vrh među ostalim softverskim okvirima za frontend programiranje. Pored toga, Butstrep je drugi repozitorijum na GitHub-u po broju korisničkih ocena (zvezdica), odmah nakon freeCodeCamp repozitorijuma.",
    "bs4-usage-text-2": "Takođe, po podacima iz 2018. godine, Butstrep je zastupljen na oko 18% od prvih 1 milion sajtova po posetama na internetu, ili u 17% u prvih deset hiljada.",
    "tutorial-title": "Uputstvo kako koristiti Butstrep",
    "tutorial-step-1-title": "Korak 1",
    "tutorial-step-1-text-1": "Posetite",
    "tutorial-step-1-text-2": " i kliknite na Download dugme.",
    "tutorial-step-2-title": "Korak 2",
    "tutorial-step-2-text-1": "Otpakujte sadržinu .zip fajla koji ste preuzeli i uvrstite dobijeni folder u svoj projekat.",
    "tutorial-step-3-title": "Korak 3",
    "tutorial-step-3-text-1": "U okviru zaglavlja vaše stranice (&lt;head> tag), dodajte sledeći kôd (može se razlikovati od interne strukture vašeg projekta):",
    "tutorial-step-3-text-2": "Alternativno, možete koristiti i Butstrep mrežu za nabavku sadržaja (CDN) i direktno ugraditi kodove u zaglavlje, idućim redom:",
    "examples-title": "Kako Butstrep olakšava rad?",
    "examples-text": "Sem ranije navedenih pomoći oko responzivnosti, Butstrep omogućava brzo kreiranje elemenata i željenih rezultata običnim dodavanjem ugrađenih Butstrep klasi u kôd. Obično ovo ima primenu kod nekih gotovih šablona koje je naporno iznova i iznova kodirati, a često se koriste.",
    "example-1-title": "Tabela sa tamnom pozadinom i hover efektom",
    "example-2-title": "Padajući meni",
    "example-3-title": "Navigacioni meni",
    "download-text": "Preuzmi",
    "playground-html-text": "Piši HTML kod ovde ili kopiraj odozgo",
    "playground-js-text": "Oprobaj se u JS",
    "templates-text": "Ovde možete videti i preuzeti neke gotove Butstrep šablone za korišćenje.",
    "bs4-playground-title-1": "Butstrep 4 zaglavlje",
    "bs4-playground-button-1": "Kliknite ovde da biste kopirali kôd!"

}