{
        "index-page-title": "Почетна",
        "playground-page-title": "Игралиште",
        "templates-page-title": "Галерија",
        "title": "Бутстреп 4",
        "menu-1": "Почетна",
        "menu-2": "Бутстреп 4",
        "menu-3": "Предности",
        "menu-4": "Примена",
        "menu-5": "Игралиште",
        "menu-6": "Галерија",
        "menu-7": "О ауторима",
        "search-placeholder": "Претрага",
        "lang": "Језик",
        "lang-1": "Српски",
        "lang-2": "Енглески",
        "title-1": "Кодирајте брже!",
        "title-2": "ПРОЈЕКТНИ ЗАДАТАК",
        "title-3": "ВЕБ ТЕХНОЛОГИЈЕ - ФТН ЧАЧАК",
        "welcome-title": "ДОБРОДОШЛИ",
        "welcome-text-1": "Овај сајт је настао као пројектни рад за предмет Веб технологије на Факултету техничких наука у Чачку.",
        "welcome-text-2": "Бутстреп (Bootstrap) Вам омогућава да брзо конструишете и стилизујете окосницу Ваше нове странице о кућним љубимцима, блога о омиљеним видео играма, пројекта за један јако занимљив предмет на факултету – укратко, где год је потребна помоћ са прављењем страница које ће изгледати лепо и функционисати подједнако добро било на телефону, таблету или десктоп рачунару, Бутстреп ће олакшати посао.",
        "welcome-text-3": "Бутстреп је бесплатан софтверски оквир (framework) отвореног кода за брзу израду веб страница које су респонзивне и који знатно олакшава рад својим уграђеним опцијама за функционалности и дизајн које се често користе, а које су тешко постижне обичним кодирањем без помоћи Бутстрепа. Стога, Бутстреп је јако коришћен, што од стране почетника, као и код великих фирми, које желе дуготрајну поузданост коју доноси Бутстреп, која је потврђена што дугим низом година, тако и великим бројем страница које га користе.",
        "welcome-text-4": "Срж Бутстрепа, с програмске стране, је иста као и код остатка Интернета, и управо то му омогућава једноставност али, с друге стране, флуидност и компатибилност:",
        "html-title": "ХТМЛ5",
        "html-text": "Основа интернета!",
        "css-title": "ЦСС3",
        "css-text": "Улепшајте основу!",
        "js-title": "ЈС",
        "js-text": "Удахните основи живот!",
        "other-tech-title": "ТЕХНОЛОГИЈЕ",
        "other-tech-text": "Сем наведених технологија, у реализацији овог пројекта коришћени су и:",
        "vs-title": "Visual Studio Code",
        "vs-text": "Мултипрограмски едитор за уређивање изворног кода, са фокусом на развој веб страница, са великим број доступних библиотека и екстензија за олакшан рад и додате могућности.",
        "vs-button-text": "Посетите Visual Studio Code!",
        "git-title": "GitHub",
        "git-text": "Водећа платформа за управљање верзијама изворног кода уз помоћ Git система, круцијална за успешан рад и завршавање пројекта.",
        "git-button-text": "Посетите GitHub!",
        "meet-team": "УПОЗНАЈТЕ ТИМ",
        "member-1": " Стефан Јовановић",
        "member-2": " Предраг Радовановић",
        "member-3": " Славко Џуловић",
        "pr-birth-date": "Датум рођења: 21.07.1997",
        "pr-birth-place": "Место рођења: Пожега",
        "pr-index-num": "Број индекса: 14-2016",
        "pr-high-school": "Средња школа: Гимназија Пожега",
        "pr-faculty": "Факултет: Факултет Техничких Наука у Чачку",
        "pr-dir": "Смер: Информационе технологије",
        "pr-gpa": "Просек: 8.00",
        "sdz-birth-date": "Датум рођења: 10.01.1998",
        "sdz-birth-place": "Место рођења: Прибој",
        "sdz-index-num": "Број индекса: 87-2016",
        "sdz-high-school": "Средња школа: Гимназија Прибој",
        "sdz-faculty": "Факултет: Факултет Техничких Наука у Чачку",
        "sdz-dir": "Смер: Информационе технологије",
        "sdz-gpa": "Просек: 9.30",
        "sj-birth-date": "Датум рођења: 10.01.1998",
        "sj-birth-place": "Место рођења: Јагодина",
        "sj-index-num": "Број индекса: 34-2016",
        "sj-high-school": "Средња школа: Технолошка школа Параћин",
        "sj-faculty": "Факултет: Факултет Техничких Наука у Чачку",
        "sj-dir": "Смер: Информационе технологије",
        "sj-gpa": "Просек: 9.20",
        "footer-title": "О пројекту",
        "footer-text": "Овај сајт је креиран по захтевима пројектног задатка за предмет Веб технологије на Факултету техничких наука у Чачку, у циљу полагања испита и формирања завршне оцене. У раду на овом сајту су учествовали студенти Стефан Јовановић, Предраг Радовановић и Славко Џуловић. Тема овог пројектног рада је frontend framework Bootstrap 4.",
        "copyright-text": "© 2019 Сва права задржана: METRoTEAM",
        "_comment": "BOOTSTRAP 4 PAGE",
        "bs4-title": "БУТСТРЕП 4",
        "bs4-title-1": "Одакле Бутстреп?",
        "bs4-text-1": "Бутстреп није од свог почетка био овај фрејмворк који је коришћен у свим размерама широм интернета.",
        "bs4-text-2": "Првобитно знан као Twitter Blueprint, Бутстреп је настао као чедо Твитерових програмера за интерне потребе побољшавања самог Твитера, да би заменио све претходне библиотеке које су биле у употреби али нису задовољавале стандарде, јер су нарушавале интерну стабилност и наносиле су велике трошкове одржавања. Иако није било у плану да се направи нови фрејмворк, спонтано, додавањем и усавршавањем кода, створен је нови производ, који је постао доступан широј програмерској сцени 19. априла 2011.",
        "bs4-versions-title": "Верзије",
        "bs4-versions-text-1": "Након почетне верзије, када је већ постало јасно да је Бутстреп превазишао оквире Твитера, прешло се на активан развој и одржавање као издвојен пројекат.",
        "bs4-versions-text-2": "Са верзијом 2, Бутстрепу је прикључена подршка за иконице (Glyphicons), као и пар нових компоненти. Такође, основа будућег развоја Бутстрепа, као и оно по чему је Бутстреп био пионир у својој области, додато је у другој стабилној верзији. Респонзивни дизајн је додат као опциона функционалност, која није била наметана као мандаторна, али је свакако постала одређујућа карактеристика Бутстрепа за ту, као и све наредне верзије.",
        "bs4-versions-text-3": "У верзији три, арпила 2013, прешло се на минималистички дизајн, а респонзивност је постала подразумевана опција, и почело се са форсирањем верзија за мобилне уређаје, такозвани mobile-first приступ у дизајну.",
        "bs4-versions-text-4": "Са верзијом 4, јануара 2018, дошло је до велике измене у интерној структури и коду унутар Бутстрепа. Промењен је препроцесорски језик за компајлирање CSS-a (са Less прешло се на Sass), пиксели су замењени као стандардна мерна јединица тзв. ем јединицом, избачена је подршка за Glyphicon класу, а као најбитнија промена наводи се коришћење CSS Flexbox модела распореда, што је додатно побољшало флексибилност у раду.",
        "bs4-usage-title": "Где се користи Бутстреп?",
        "bs4-usage-text-1": "Управо због своје једноставности, а великих постигнутих резултата, Бутстреп се за релативно кратко време пробио на врх међу осталим софтверским оквирима за фронтенд програмирање. Поред тога, Бутстреп је други репозиторијум на GitHub-у по броју корисничких оцена (звездица), одмах након freeCodeCamp репозиторијума.",
        "bs4-usage-text-2": "Такође, по подацима из 2018. године, Бутстреп је заступљен на око 18% од првих 1 милион сајтова по посетама, на интернету, или у 17% у првих десет хиљада."

}